# Logistic Regression - Group 5
## Data cleaning of the excel file

In [8]:
import pandas as pd
dataset = pd.read_csv('bank.csv')

In [9]:
dataset.head()

,age,job,marital,education,balance,housing,loan,duration,campaign,deposit
0,59,admin.,married,secondary,2343,yes,no,1042,1,yes
1,56,admin.,married,secondary,45,no,no,1467,1,yes
2,41,technician,married,secondary,1270,yes,no,1389,1,yes
3,55,services,married,secondary,2476,yes,no,579,1,yes
4,54,admin.,married,tertiary,184,no,no,673,2,yes

In [10]:
X = dataset.iloc[:,:-1].values
X

array([[59, 'admin.', 'married', ..., 'no', 1042, 1],
       [56, 'admin.', 'married', ..., 'no', 1467, 1],
       [41, 'technician', 'married', ..., 'no', 1389, 1],
       ...,
       [32, 'technician', 'single', ..., 'no', 156, 2],
       [43, 'technician', 'married', ..., 'yes', 9, 2],
       [34, 'technician', 'married', ..., 'no', 628, 1]], dtype=object)

In [11]:
y = dataset.iloc[: , -1].values
y

array(['yes', 'yes', 'yes', ..., 'no', 'no', 'no'], dtype=object)

### Check for missing values in each Rows and column.

In [5]:
#columns
missing_column = dataset.isnull().sum()
missing_column

age            0
job           70
marital        0
education    497
balance        0
housing        0
loan           0
duration       0
campaign       0
deposit        0
dtype: int64

In [13]:
#rows
missing_values = dataset[dataset.isnull().any(axis=1)]
missing_values

,age,job,marital,education,balance,housing,loan,duration,campaign,deposit
44,52,management,married,NaN,2240,yes,no,845,1,yes
58,40,technician,single,NaN,3652,yes,no,1028,2,yes
65,44,blue-collar,married,NaN,146,yes,no,483,1,yes
66,49,NaN,married,primary,341,yes,yes,520,2,yes
75,36,services,single,NaN,281,yes,no,515,1,yes
...,...,...,...,...,...,...,...,...,...,...
11017,42,blue-collar,married,NaN,1154,yes,no,341,2,no
11038,36,blue-collar,married,NaN,1023,yes,no,184,2,no
11059,35,technician,single,NaN,726,yes,no,163,1,no
11072,41,technician,single,NaN,356,yes,no,93,2,no
11137,49,retired,married,NaN,247,no,no,213,2,no

### Data Cleaning

#### Step 1: Handle missing values

In [46]:

# Fill missing categorical values with the mode (most frequent value)
dataset['job'].fillna(dataset['job'].mode()[0], inplace=True)
dataset['education'].fillna(dataset['education'].mode()[0], inplace=True)

C:\Users\Angela\AppData\Local\Temp\ipykernel_29228\2263412951.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  dataset['job'].fillna(dataset['job'].mode()[0], inplace=True)
C:\Users\Angela\AppData\Local\Temp\ipykernel_29228\2263412951.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  dataset['education'].fillna(dataset['education'].mode()[0], inplace=True)

#### Step 2: Converting worded data to numeric data.

In [47]:
from sklearn.preprocessing import LabelEncoder
label_encoder = LabelEncoder()

In [49]:
dataset['job'] = label_encoder.fit_transform(dataset['job'])
dataset['marital'] = label_encoder.fit_transform(dataset['marital'])
dataset['education'] = label_encoder.fit_transform(dataset['education'])
dataset['housing'] = label_encoder.fit_transform(dataset['housing'])
dataset['loan'] = label_encoder.fit_transform(dataset['loan'])
dataset['deposit'] = label_encoder.fit_transform(dataset['deposit'])

#### Step 3: Save the cleaned data

In [50]:
cleaned_file_path = dataset.to_csv('Cleaned_bank_5rd trial.csv', index=False)